import heapq

#Нехай у списку cables - довжини кабелів
cables = [5, 2, 3, 1, 6, 9]
total_sum = []

#Для вирішення завдання про кабелі створимо мінімальну купу
#Будемо з'єднувати кабелі мінімальної довжини

#Перетворимо масив на кучу
heapq.heapify(cables)
sum_total = 0
for i in range(len(cables) - 1):
    if i == 0:
        #На нульовому кроці візьмемо 2 найменші елементи
        min_els = heapq.nsmallest(2, cables)
        #Повидаляємо обдва мінімальні елементи з кучі
        heapq.heappop(cables)
        heapq.heappop(cables)
        #Порахуємо суму двох мінімальних елементів
        total_sum.append(sum(min_els))
    else:
        #Отримаємо наступний мінімальний елемент з кучі
        min = heapq.heappop(cables)

        #Якщо список має лише один елемент, то цей елемент показує
        #Довжину з'єднаних двох кабелів

        if len(total_sum) == 1:
            #Визначаю довжину кабеля поєднаного з новим мінімальним значенням довжини
            sum1 = total_sum[0] + min
            #Додамо визначену сумму ще одним елементом, тепер у total_sum два елементи
            #Нульовий елемент - це кумулятивна сума всіх кроків,
            #Перший елемент - це довжина кабеля на даний момент
            total_sum.append(sum1)
            total_sum[0] += sum1
        else:
            #Оновлюємо довжину кабеля
            total_sum[1] += min
            #Оновлюємо кумулятивну суму
            total_sum[0] += total_sum[1]


print(total_sum)
